Configuration_project_01/src/Documents/АЭС_МатрицаСкладовПоПриоритетам/АЭС_МатрицаСкладовПоПриоритетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АЭС_МатрицаСкладовПоПриоритетам</name>
  <registerRecords>InformationRegister.АЭС_ПриоритетыСкладов</registerRecords>
  <registerRecords>InformationRegister.АЭС_АктуальныеПриоритеты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатрицы</name>
    <type>
      <types>EnumRef.АЭС_ВидМатрицыРезервирования</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПриоритетов</name>
    <attributes>
      <name>ПунктКуда</name>
      <type>
        <types>CatalogRef.АЭС_ПунктыВыдачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктОткуда</name>
      <type>
        <types>CatalogRef.АЭС_ПунктыВыдачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктВыдачи</name>
    <attributes>
      <name>ИдентификаторКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.АЭС_ПунктыВыдачи</types>
      </type>
    </attributes>
    <attributes>
      <name>СкладРезерва</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриоритетыПоСкладам</name>
    <attributes>
      <name>ПунктКуда</name>
      <type>
        <types>CatalogRef.АЭС_ПунктыВыдачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктОткуда</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration_project_01/src/Enums/АЭС_ВидМатрицыРезервирования/АЭС_ВидМатрицыРезервирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АЭС_ВидМатрицыРезервирования</name>
  <enumValues>
    <name>ПоСкладам</name>
  </enumValues>
  <enumValues>
    <name>ПоПунктамВыдачи</name>
  </enumValues>
</mdclass:Enum>

Configuration_project_01/src/Catalogs/АЭС_ПунктыВыдачи/АЭС_ПунктыВыдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АЭС_ПунктыВыдачи</name>
  <attributes>
    <name>КодРегион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЗаданияПользователям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Розничный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Configuration_project_01/src/Documents/АЭС_МатрицаСкладовПоПриоритетам/ManagerModule.bsl
Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаСреза", 		ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("БизнесРегион", 	ДокументСсылка.БизнесРегион);
	
КонецПроцедуры

Функция ПолучитьСписокПунктовВыдачиПоОрганизации(Организация) Экспорт	
	
	Запрос	= Новый Запрос;
	ТекстЗапроса	= "
	
		|ВЫБРАТЬ
		|	АЭС_ПунктыВыдачи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АЭС_ПунктыВыдачи КАК АЭС_ПунктыВыдачи
		|ГДЕ
		|	АЭС_ПунктыВыдачи.Организация = &Организация
		|	И НЕ АЭС_ПунктыВыдачи.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	АЭС_ПунктыВыдачи.Наименование";
	
	Запрос.Текст	= ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Организация",Организация);
		
	ВыборкаПунктыВыдачи	= Запрос.Выполнить().Выгрузить();
	
	Возврат ВыборкаПунктыВыдачи;
		
КонецФункции // Функция ПолучитьСписокПунктовВыдачиПоОрганизации(Организация) Экспорт

Функция ПолучитьСписокСкладовПоОрганизации(БизнесРегион) Экспорт	
	
	Запрос	= Новый Запрос;
	ТекстЗапроса	= "
	
		|ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.БизнесРегион = &БизнесРегион
		|	И НЕ Склады.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склады.Ссылка.Наименование";
	
	Запрос.Текст	= ТекстЗапроса;
	
	Запрос.УстановитьПараметр("БизнесРегион",БизнесРегион);
		
	ВыборкаПунктыВыдачи	= Запрос.Выполнить().Выгрузить();
	
	Возврат ВыборкаПунктыВыдачи;
		
КонецФункции // Функция ПолучитьСписокПунктовВыдачиПоОрганизации(Организация) Экспорт

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	Если ДокументСсылка.ВидМатрицы	= Перечисления.АЭС_ВидМатрицыРезервирования.ПоПунктамВыдачи Тогда
		ТекстЗапросаТаблицаПунктовВыдачи(Запрос, ТекстыЗапроса, Регистры);
	Иначе
		ТекстЗапросаТаблицаПунктовВыдачиПоСкладам(Запрос, ТекстыЗапроса, Регистры);
	КонецЕсли; // Если ДокументСсылка.ВидМатрицы	= Перечисления.АЭС_ВидМатрицыРезервирования.ПоПунктамВыдачи Тогда
	
	ТекстЗапросаАктуальныеПунктыВыдачи(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры // Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт

Функция ТекстЗапросаТаблицаПунктовВыдачи(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "АЭС_ПриоритетыСкладов";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
		
	ТекстЗапроса ="
		|ВЫБРАТЬ
		|	Матрица.ПунктКуда 	КАК ПунктВыдачи,
		|	Матрица.Ссылка.Дата КАК ПЕРИОД,
		|	Матрица.Приоритет 	КАК Приоритет,
		|	Склады.Склад 		КАК Склад	
		|ИЗ
		|	Документ.АЭС_МатрицаСкладовПоПриоритетам.ТаблицаПриоритетов КАК Матрица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АЭС_ПунктыВыдачи.Склады КАК Склады
		|		ПО (Матрица.ПунктОткуда = Склады.Ссылка)
		|ГДЕ
		|	Матрица.Ссылка = &Ссылка";

	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаАктуальныеПунктыВыдачи(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "АЭС_АктуальныеПриоритеты";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
		
	ТекстЗапроса ="
		|ВЫБРАТЬ
		|	Матрица.Организация	КАК Организация,
		|	Матрица.Ссылка.Дата КАК ПЕРИОД,
		|	Матрица.Ссылка		КАК Документ
		|ИЗ
		|	Документ.АЭС_МатрицаСкладовПоПриоритетам КАК Матрица
		|ГДЕ
		|	Матрица.Ссылка = &Ссылка";

	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаТаблицаПунктовВыдачиПоСкладам(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	ИмяРегистра = "АЭС_ПриоритетыСкладов";
	
	Если Не ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
		
	ТекстЗапроса ="
		|ВЫБРАТЬ
		|	Матрица.ПунктКуда КАК ПунктВыдачи,
		|	Матрица.Ссылка.Дата КАК ПЕРИОД,
		|	Матрица.Приоритет КАК Приоритет,
		|	Матрица.ПунктОткуда КАК Склад
		|ИЗ
		|	Документ.АЭС_МатрицаСкладовПоПриоритетам.ПриоритетыПоСкладам КАК Матрица
		|ГДЕ
		|	Матрица.Ссылка = &Ссылка";

	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
